>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. ACCOUNT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 ACCOUNT-NAME PIC X(30) VALUE 'Contoso Checking'.
01 BALANCE PIC 9(7)V99 VALUE 1000.00.
PROCEDURE DIVISION.
    ADD 125 TO BALANCE.
    DISPLAY ACCOUNT-NAME BALANCE.
    IF BALANCE > 0 DISPLAY 'ACCOUNT IS IN CREDIT'.
    STOP RUN.
