>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. DAILYREPORT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 TITLE PIC X(30) VALUE 'DAILY BALANCE REPORT'.
01 TOTAL PIC 9(7)V99 VALUE 7250.00.
PROCEDURE DIVISION.
    DISPLAY TITLE.
    DISPLAY TOTAL.
    STOP RUN.
