       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 GREETING PIC X(30) VALUE 'Hello from COBOL on .NET'.
       PROCEDURE DIVISION.
           DISPLAY GREETING.
           STOP RUN.
